app/controllers/interviews_controller.rb

  def show
    @interview = Interview.find(params[:id])
---
SELECT `interviews`.* FROM `interviews` WHERE `interviews`.`id` = 1 LIMIT 1

  def edit
    @interview = Interview.find(params[:id])
---
SELECT `interviews`.* FROM `interviews` WHERE `interviews`.`id` = 1 LIMIT 1

  def create
    @interview = Interview.new(params[:interview])



    respond_to do |format|
      if @interview.save
---
INSERT INTO `interviews` (`phoneNumber`, `email`, `ror_exp`, `total_exp`, `updated_at`, `remarks`, `result`, `name`, `type_location`, `doi`, `created_at`) VALUES ('9920149993', 'zapper320@gmail.com', 23, 2, '2011-05-23 07:28:06', 'dfvkndkvn', 'Pass', 'ashish', 'Mumbai', '2011-05-18 00:00:00', '2011-05-23 07:28:06')

  def update

    @interview = Interview.find(params[:id])
    @attachment = Attachment.new(params[:attachment])
    @attachment.interview_id = @interview.id
    @attachment.save

    respond_to do |format|
      if @interview.update_attributes(params[:interview])
---
SELECT `interviews`.* FROM `interviews` WHERE `interviews`.`id` = 1 LIMIT 1
UPDATE `interviews` SET `updated_at` = '2011-05-16 10:32:14', `doi` = '2011-05-20 00:00:00' WHERE `interviews`.`id` = 1